tutorials/verificationAndValidation/turbulentInflow/system/sampling
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampling;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inletSampling
{
    type                sets;
    libs                (sampling);
    writeControl        writeTime;
    timeStart           $/timeStart;

    interpolationScheme cellPoint;
    setFormat           raw;
    fields              (UPrime2Mean);

    sets
    (
        inletPatch
        {
            type        face;
            axis        y;
            start       (0.0 0 1.57);
            end         (0.0 2 1.57);
        }
        inletCell
        {
            type        midPoint;
            axis        y;
            start       (0.062832 0 1.57);
            end         (0.062832 2 1.57);
        }
    );
}

// ************************************************************************* //
